import type { Tour } from '@/types/tour';

export const sources = [
  {
    "name": "假日通",
    "logo": "/icons/假日通.png",
    "color": "#FF6B35"
  },
  {
    "name": "广东中旅",
    "logo": "/icons/广东中旅.png",
    "color": "#8338EC"
  },
  {
    "name": "广之旅",
    "logo": "/icons/广之旅.png",
    "color": "#FF006E"
  },
  {
    "name": "广州去旅行",
    "logo": "/icons/广州去旅行.png",
    "color": "#4ECDC4"
  },
  {
    "name": "康辉",
    "logo": "/icons/康辉.png",
    "color": "#1A535C"
  }
];

export const destinations = [
  "三亚",
  "云南",
  "其他",
  "北京",
  "厦门",
  "四川",
  "广东",
  "张家界",
  "新疆",
  "桂林",
  "桂林 崀山",
  "桂林 漓江 阳朔",
  "桂林 阳朔",
  "桂林 阳朔 相公山 十里画廊",
  "梅里雪山",
  "武汉市",
  "武隆天生桥",
  "毕节地区 格凸河 万峰林 马岭河峡谷 韭菜坪",
  "江门市",
  "河源市",
  "海口市",
  "深圳市",
  "深圳市 惠州市",
  "清远市",
  "温州市",
  "湛江市",
  "漠河",
  "潮州市",
  "石家庄市",
  "科伦坡市",
  "腾格里",
  "自由行",
  "花湖 若尔盖大草原 四姑娘山 九寨沟 黄龙",
  "茂名",
  "茶卡盐湖",
  "莫高窟",
  "萍乡市",
  "衡阳市 郴州市 长沙",
  "衢州",
  "西双版纳",
  "西宁",
  "西安",
  "西藏",
  "贵州"
];

export const themes = [
  "亲子游",
  "冰雪世界",
  "古镇文化",
  "户外徒步",
  "摄影之旅",
  "民族风情",
  "海岛度假",
  "美食之旅",
  "自然风光"
];

export const tours: Tour[] = [];
